bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
    if ((type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched) && msg->text.embed.enable)
    {
      if (msg->text.embed.type == esp_mail_smtp_embed_message_type_attachment)
        appendP(header, esp_mail_str_30, false);
      else if (msg->text.embed.type == esp_mail_smtp_embed_message_type_inline)
        appendP(header, esp_mail_str_299, false);

      if (strlen(msg->text.embed.filename) > 0)
        header += msg->text.embed.filename;
      else
        appendP(header, esp_mail_str_164, false);
      appendP(header, esp_mail_str_36, false);

      if (msg->text.embed.type == esp_mail_smtp_embed_message_type_inline)
      {
        appendP(header, esp_mail_str_300, false);
        if (strlen(msg->text.embed.filename) > 0)
          header += msg->text.embed.filename;
        else
          appendP(header, esp_mail_str_159, false);
        appendP(header, esp_mail_str_34, false);

        appendP(header, esp_mail_str_301, false);
        header += msg->text._int.cid;
        appendP(header, esp_mail_str_15, false);
        appendP(header, esp_mail_str_34, false);
      }
    }
    else if (type == esp_mail_msg_type_html && msg->html.embed.enable)
    {
      if (msg->html.embed.type == esp_mail_smtp_embed_message_type_attachment)
        appendP(header, esp_mail_str_30, false);
      else if (msg->html.embed.type == esp_mail_smtp_embed_message_type_inline)
        appendP(header, esp_mail_str_299, false);

      if (strlen(msg->html.embed.filename) > 0)
        header += msg->html.embed.filename;
      else
        appendP(header, esp_mail_str_159, false);
      appendP(header, esp_mail_str_36, false);

      if (msg->html.embed.type == esp_mail_smtp_embed_message_type_inline)
      {
        appendP(header, esp_mail_str_300, false);
        if (strlen(msg->html.embed.filename) > 0)
          header += msg->html.embed.filename;
        else
          appendP(header, esp_mail_str_159, false);
        appendP(header, esp_mail_str_34, false);

        appendP(header, esp_mail_str_301, false);
        header += msg->html._int.cid;
        appendP(header, esp_mail_str_15, false);
        appendP(header, esp_mail_str_34, false);
      }
    }
  }

  appendP(header, esp_mail_str_34, false);

  if ((msg->text.blob.size > 0 && (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)) || (msg->html.blob.size > 0 && type == esp_mail_msg_type_html))
  {
    if (!bdat(smtp, msg, header.length(), false))
      return false;

    if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    header.clear();

    if (!sendBlobBody(smtp, msg, type))
      return false;
  }
  else if ((strlen(msg->text.file.name) > 0 && (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)) || (strlen(msg->html.file.name) > 0 && type == esp_mail_msg_type_html))
  {
    if (!bdat(smtp, msg, header.length(), false))
      return false;

    if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    header.clear();

    if (!sendFileBody(smtp, msg, type))
      return false;
  }
  else
    encodingText(smtp, msg, type, header);

  appendP(header, esp_mail_str_34, false);

  if (strlen(boundary) > 0)
    appendP(header, esp_mail_str_34, false);

  if (!bdat(smtp, msg, header.length(), false))
    return false;

  if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  return true;
}

char *ESP_Mail_Client::getUID()
{
  char *tmp = new char[36];
  memset(tmp, 0, 36);
  itoa(random(10000000, 20000000), tmp, 10);
  return tmp;
}

bool ESP_Mail_Client::sendBlobBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type)
{

  if (msg->text.blob.size == 0 && msg->html.blob.size == 0)
    return true;

  bool ret = true;
  int bufLen = 512;
  size_t pos = 0;
  int pg = 0, _pg = 0;

  if (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)
  {
    char *tmp = strP(esp_mail_str_325);

    if (strlen(msg->text.transfer_encoding) > 0)
    {
      if (strcmp(msg->text.transfer_encoding, Content_Transfer_Encoding::enc_base64) == 0)
      {
        ret = sendBase64(smtp, msg, (const unsigned char *)msg->text.blob.data, msg->text.blob.size, true, tmp, smtp->_sendCallback != NULL);
        delS(tmp);
        return ret;
      }
    }

    int len = msg->text.blob.size;
    int available = len;
    uint8_t *buf = new uint8_t[bufLen + 1];
    while (available)
    {
      if (available > bufLen)
        available = bufLen;

      memcpy_P(buf, msg->text.blob.data + pos, available);

      if (!bdat(smtp, msg, available, false))
        break;
      if (smtpSend(smtp, buf, available) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        break;
      pos += available;
      len -= available;
      available = len;
      if (smtp->_sendCallback)
      {
        pg = (float)(100.0f * pos / msg->text.blob.size);
        if (pg != _pg)
          uploadReport(tmp, pg);
        _pg = pg;
      }
    }
    delete[] buf;
    delS(tmp);
  }
  else if (type == esp_mail_message_type::esp_mail_msg_type_html)
  {
    char *tmp = strP(esp_mail_str_325);

    if (strlen(msg->html.transfer_encoding) > 0)
    {
      if (strcmp(msg->html.transfer_encoding, Content_Transfer_Encoding::enc_base64) == 0)
      {
        ret = sendBase64(smtp, msg, (const unsigned char *)msg->html.blob.data, msg->html.blob.size, true, tmp, smtp->_sendCallback != NULL);
        delS(tmp);
        return ret;
      }
    }
    int len = msg->html.blob.size;
    int available = len;
    uint8_t *buf = new uint8_t[bufLen + 1];
    while (available)
    {

      if (available > bufLen)
        available = bufLen;

      memcpy_P(buf, msg->html.blob.data + pos, available);

      if (!bdat(smtp, msg, available, false))
      {
        ret = false;
        break;
      }

      if (smtpSend(smtp, buf, available) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      {
        ret = false;
        break;
      }
      pos += available;
      len -= available;
      available = len;
      if (smtp->_sendCallback)
      {
        pg = (float)(100.0f * pos / msg->html.blob.size);
        if (pg != _pg)
          uploadReport(tmp, pg);
        _pg = pg;
      }
    }
    delete[] buf;
    delS(tmp);
  }
  return ret;
}

bool ESP_Mail_Client::sendFileBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type)
{

  if (strlen(msg->text.file.name) == 0 && strlen(msg->html.file.name) == 0)
    return true;

  bool ret = true;
  size_t chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
  size_t writeLen = 0;
  int pg = 0, _pg = 0;

  if (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)
  {

    if (!openFileRead2(smtp, msg, file, msg->text.file.name, msg->text.file.type))
      return false;

    char *tmp = strP(esp_mail_str_326);

    if (strlen(msg->text.transfer_encoding) > 0)
    {
      if (strcmp(msg->text.transfer_encoding, Content_Transfer_Encoding::enc_base64) == 0)
      {
        ret = sendBase64Stream(smtp, msg, file, tmp, smtp->_sendCallback != NULL);
        delS(tmp);
        return ret;
      }
    }

    if (file.size() > 0)
    {

