bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
    if (strcmpP(buf, 0, esp_mail_str_10))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_from;
      tmp = subStr(buf, esp_mail_str_10, NULL, 0, -1);
      setHeader(imap, tmp, header, headerState);
      delS(tmp);
    }
    else if (strcmpP(buf, 0, esp_mail_str_11))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_to;
      tmp = subStr(buf, esp_mail_str_11, NULL, 0, -1);
      setHeader(imap, tmp, header, headerState);
      delS(tmp);
    }
    else if (strcmpP(buf, 0, esp_mail_str_276))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_cc;
      tmp = subStr(buf, esp_mail_str_276, NULL, 0, -1);
      setHeader(imap, tmp, header, headerState);
      delS(tmp);
    }
    else if (strcmpP(buf, 0, esp_mail_str_279))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_subject;
      tmp = subStr(buf, esp_mail_str_279, NULL, 0, -1);
      setHeader(imap, tmp, header, headerState);
      delS(tmp);
    }
    else if (strcmpP(buf, 0, esp_mail_str_25))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_content_type;
      tmp = subStr(buf, esp_mail_str_25, esp_mail_str_97, 0);
      if (tmp)
      {
        setHeader(imap, buf, header, headerState);
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_172))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_content_transfer_encoding;
      tmp = subStr(buf, esp_mail_str_172, NULL, 0, -1);
      if (tmp)
      {
        setHeader(imap, tmp, header, headerState);
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_190))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_accept_language;
      tmp = subStr(buf, esp_mail_str_190, NULL, 0, -1);
      if (tmp)
      {
        setHeader(imap, tmp, header, headerState);
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_191))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_content_language;
      tmp = subStr(buf, esp_mail_str_191, NULL, 0, -1);
      if (tmp)
      {
        setHeader(imap, tmp, header, headerState);
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_273))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_date;
      tmp = subStr(buf, esp_mail_str_273, NULL, 0, -1);
      if (tmp)
      {
        setHeader(imap, tmp, header, headerState);
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_274))
    {
      headerState = esp_mail_imap_header_state::esp_mail_imap_state_msg_id;
      tmp = subStr(buf, esp_mail_str_274, NULL, 0, -1);
      if (tmp)
      {
        setHeader(imap, tmp, header, headerState);
        delS(tmp);
      }
    }
    chunkIdx++;
  }
}

void ESP_Mail_Client::setHeader(IMAPSession *imap, char *buf, struct esp_mail_message_header_t &header, int state)
{
  switch (state)
  {
  case esp_mail_imap_header_state::esp_mail_imap_state_from:
    header.from += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_to:
    header.to += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_cc:
    header.cc += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_subject:
    header.subject += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_content_type:
    header.content_type += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_content_transfer_encoding:
    header.content_transfer_encoding += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_accept_language:
    header.accept_language += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_content_language:
    header.content_language += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_date:
    header.date += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_msg_id:
    header.message_id += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_char_set:
    header.char_set += buf;
    break;
  case esp_mail_imap_header_state::esp_mail_imap_state_boundary:
    header.boundary += buf;
    break;
  default:
    break;
  }
}

void ESP_Mail_Client::handlePartHeader(IMAPSession *imap, char *buf, int &chunkIdx, struct esp_mail_message_part_info_t &part)
{
  char *tmp = nullptr;
  if (chunkIdx == 0)
  {
    tmp = subStr(buf, esp_mail_imap_response_7, NULL, 0, -1);
    if (tmp)
    {
      delS(tmp);
      tmp = subStr(buf, esp_mail_str_193, esp_mail_str_194, 0);
      if (tmp)
      {
        chunkIdx++;
        part.octetLen = atoi(tmp);
        delS(tmp);
      }
    }
  }
  else
  {
    if (strcmpP(buf, 0, esp_mail_str_25))
    {
      tmp = subStr(buf, esp_mail_str_25, esp_mail_str_97, 0);
      bool con_type = false;
      if (tmp)
      {
        con_type = true;
        part.content_type = tmp;
        delS(tmp);
        int p1 = strposP(part.content_type.c_str(), esp_mail_imap_composite_media_type_t::multipart, 0);
        if (p1 != -1)
        {
          p1 += strlen(esp_mail_imap_composite_media_type_t::multipart) + 1;
          part.multipart = true;
          //inline or embedded images
          if (strpos(part.content_type.c_str(), esp_mail_imap_multipart_sub_type_t::related, p1) != -1)
            part.multipart_sub_type = esp_mail_imap_multipart_sub_type_related;
          //multiple text formats e.g. plain, html, enriched
          else if (strpos(part.content_type.c_str(), esp_mail_imap_multipart_sub_type_t::alternative, p1) != -1)
            part.multipart_sub_type = esp_mail_imap_multipart_sub_type_alternative;
          //medias
          else if (strpos(part.content_type.c_str(), esp_mail_imap_multipart_sub_type_t::parallel, p1) != -1)
            part.multipart_sub_type = esp_mail_imap_multipart_sub_type_parallel;
          //rfc822 encapsulated
          else if (strpos(part.content_type.c_str(), esp_mail_imap_multipart_sub_type_t::digest, p1) != -1)
            part.multipart_sub_type = esp_mail_imap_multipart_sub_type_digest;
          else if (strpos(part.content_type.c_str(), esp_mail_imap_multipart_sub_type_t::report, p1) != -1)
            part.multipart_sub_type = esp_mail_imap_multipart_sub_type_report;
          //others can be attachments
          else if (strpos(part.content_type.c_str(), esp_mail_imap_multipart_sub_type_t::mixed, p1) != -1)
            part.multipart_sub_type = esp_mail_imap_multipart_sub_type_mixed;
        }

        p1 = strposP(part.content_type.c_str(), esp_mail_imap_composite_media_type_t::message, 0);
        if (p1 != -1)
        {
          p1 += strlen(esp_mail_imap_composite_media_type_t::message) + 1;
          if (strpos(part.content_type.c_str(), esp_mail_imap_message_sub_type_t::rfc822, p1) != -1)
            part.message_sub_type = esp_mail_imap_message_sub_type_rfc822;
          else if (strpos(part.content_type.c_str(), esp_mail_imap_message_sub_type_t::Partial, p1) != -1)
            part.message_sub_type = esp_mail_imap_message_sub_type_partial;
          else if (strpos(part.content_type.c_str(), esp_mail_imap_message_sub_type_t::External_Body, p1) != -1)
            part.message_sub_type = esp_mail_imap_message_sub_type_external_body;
          else if (strpos(part.content_type.c_str(), esp_mail_imap_message_sub_type_t::delivery_status, p1) != -1)
            part.message_sub_type = esp_mail_imap_message_sub_type_delivery_status;
        }

        p1 = strpos(part.content_type.c_str(), esp_mail_imap_descrete_media_type_t::text, 0);
        if (p1 != -1)
        {
          p1 += strlen(esp_mail_imap_descrete_media_type_t::text) + 1;
          if (strpos(part.content_type.c_str(), esp_mail_imap_media_text_sub_type_t::plain, p1) != -1)
            part.msg_type = esp_mail_msg_type_plain;
          else if (strpos(part.content_type.c_str(), esp_mail_imap_media_text_sub_type_t::enriched, p1) != -1)
            part.msg_type = esp_mail_msg_type_enriched;
          else if (strpos(part.content_type.c_str(), esp_mail_imap_media_text_sub_type_t::html, p1) != -1)
            part.msg_type = esp_mail_msg_type_html;
          else
            part.msg_type = esp_mail_msg_type_plain;
        }
      }

