bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
      if (con_type)
      {
        if (part.msg_type == esp_mail_msg_type_plain || part.msg_type == esp_mail_msg_type_enriched)
        {
          tmp = subStr(buf, esp_mail_str_168, esp_mail_str_136, 0);
          if (tmp)
          {
            part.charset = tmp;
            delS(tmp);
          }
          else
          {
            tmp = subStr(buf, esp_mail_str_169, NULL, 0, -1);
            if (tmp)
            {
              part.charset = tmp;
              delS(tmp);
            }
          }

          if (strposP(buf, esp_mail_str_275, 0) > -1 || strposP(buf, esp_mail_str_270, 0) > -1)
            part.plain_flowed = true;
          if (strposP(buf, esp_mail_str_259, 0) > -1 || strposP(buf, esp_mail_str_257, 0) > -1)
            part.plain_delsp = true;
        }

        if (part.charset.length() == 0)
        {
          tmp = subStr(buf, esp_mail_str_168, esp_mail_str_136, 0);
          if (tmp)
          {
            part.charset = tmp;
            delS(tmp);
          }
          else
          {
            tmp = subStr(buf, esp_mail_str_169, NULL, 0, -1);
            if (tmp)
            {
              part.charset = tmp;
              delS(tmp);
            }
          }
        }

        tmp = subStr(buf, esp_mail_str_170, esp_mail_str_136, 0);
        if (tmp)
        {
          part.name = tmp;
          delS(tmp);
        }
        else
        {
          tmp = subStr(buf, esp_mail_str_171, NULL, 0, -1);
          if (tmp)
          {
            part.name = tmp;
            delS(tmp);
          }
        }
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_172))
    {
      tmp = subStr(buf, esp_mail_str_172, NULL, 0, -1);
      if (tmp)
      {
        part.content_transfer_encoding = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_174))
    {
      tmp = subStr(buf, esp_mail_str_174, NULL, 0, -1);
      if (tmp)
      {
        part.descr = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_175))
    {
      tmp = subStr(buf, esp_mail_str_175, esp_mail_str_97, 0);
      if (tmp)
      {
        //don't count altenative part text and html as embedded contents
        if (cHeader(imap)->multipart_sub_type != esp_mail_imap_multipart_sub_type_alternative)
        {
          part.content_disposition = tmp;
          if (strcmp(tmp, esp_mail_imap_content_disposition_type_t::attachment) == 0)
            part.attach_type = esp_mail_att_type_attachment;
          else if (strcmp(tmp, esp_mail_imap_content_disposition_type_t::inline_) == 0)
            part.attach_type = esp_mail_att_type_inline;
        }
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_150))
    {
      tmp = subStr(buf, esp_mail_str_150, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.sender = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_10))
    {
      tmp = subStr(buf, esp_mail_str_10, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.from = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_11))
    {
      tmp = subStr(buf, esp_mail_str_11, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.to = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_12))
    {
      tmp = subStr(buf, esp_mail_str_12, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.cc = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_184))
    {
      tmp = subStr(buf, esp_mail_str_184, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.reply_to = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_134))
    {
      tmp = subStr(buf, esp_mail_str_134, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.comment = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_24))
    {
      tmp = subStr(buf, esp_mail_str_24, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.subject = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_189))
    {
      tmp = subStr(buf, esp_mail_str_189, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.messageID = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_46))
    {
      tmp = subStr(buf, esp_mail_str_46, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.return_path = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_99))
    {
      tmp = subStr(buf, esp_mail_str_99, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.date = tmp;
        delS(tmp);
      }
    }
    else if (strcmpP(buf, 0, esp_mail_str_145))
    {
      tmp = subStr(buf, esp_mail_str_145, NULL, 0, -1);
      if (tmp)
      {
        part.rfc822_header.keyword = tmp;
        delS(tmp);
      }
    }

    if (part.content_disposition.length() > 0)
    {
      tmp = subStr(buf, esp_mail_str_176, esp_mail_str_136, 0);
      if (tmp)
      {
        part.filename = tmp;
        delS(tmp);
      }
      else
      {
        tmp = subStr(buf, esp_mail_str_177, NULL, 0, -1);
        if (tmp)
        {
          part.filename = tmp;
          delS(tmp);
        }
      }

      tmp = subStr(buf, esp_mail_str_178, esp_mail_str_97, 0);
      if (tmp)
      {
        part.attach_data_size = atoi(tmp);
        delS(tmp);
        cHeader(imap)->total_attach_data_size += part.attach_data_size;
        part.sizeProp = true;
      }
      else
      {
        tmp = subStr(buf, esp_mail_str_178, NULL, 0, -1);
        if (tmp)
        {
          part.attach_data_size = atoi(tmp);
          delS(tmp);
          cHeader(imap)->total_attach_data_size += part.attach_data_size;
          part.sizeProp = true;
        }
      }

      tmp = subStr(buf, esp_mail_str_179, esp_mail_str_136, 0);
      if (tmp)
      {
        part.creation_date = tmp;
        delS(tmp);
      }
      else
      {
        tmp = subStr(buf, esp_mail_str_180, NULL, 0, -1);
        if (tmp)
        {
          part.creation_date = tmp;
          delS(tmp);
        }
      }

      tmp = subStr(buf, esp_mail_str_181, esp_mail_str_136, 0);
      if (tmp)
      {
        part.modification_date = tmp;
        delS(tmp);
      }
      else
      {
        tmp = subStr(buf, esp_mail_str_182, NULL, 0, -1);
        if (tmp)
        {
          part.modification_date = tmp;
          delS(tmp);
        }
      }
    }

    chunkIdx++;
  }
}

char *ESP_Mail_Client::subStr(const char *buf, PGM_P beginH, PGM_P endH, int beginPos, int endPos)
{

  char *tmp = nullptr;
  int p1 = strposP(buf, beginH, beginPos);
  if (p1 != -1)
  {
    int p2 = -1;
    if (endPos == 0)
      p2 = strposP(buf, endH, p1 + strlen_P(beginH));

    if (p2 == -1)
      p2 = strlen(buf);

    int len = p2 - p1 - strlen_P(beginH);
    tmp = newS(len + 1);
    memcpy(tmp, &buf[p1 + strlen_P(beginH)], len);
    return tmp;
  }

  return nullptr;
}

