bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
        if (header.multipart)
        {
          if (strcmpP(buf, 0, esp_mail_str_277))
          {
            tmp = subStr(buf, esp_mail_str_277, esp_mail_str_136, 0);
            if (tmp)
            {
              headerState = esp_mail_imap_header_state::esp_mail_imap_state_boundary;
              setHeader(imap, tmp, header, headerState);
              delS(tmp);
            }
          }
        }
      }

      delS(buf);

      decodeHeader(header.from, header.from_charset);
      decodeHeader(header.to, header.to_charset);
      decodeHeader(header.cc, header.cc_charset);
      decodeHeader(header.subject, header.subject_charset);

      imap->_headers.push_back(header);
    }

    if (imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_mime)
    {
      //expect the octet length in the response for the existent part
      if (part.octetLen > 0)
      {

        part.partNumStr = cHeader(imap)->partNumStr;
        part.partNumFetchStr = cHeader(imap)->partNumStr;
        if (cHeader(imap)->part_headers.size() > 0)
        {

          struct esp_mail_message_part_info_t *_part = &cHeader(imap)->part_headers[cHeader(imap)->part_headers.size() - 1];
          bool rfc822_body_subtype = _part->message_sub_type == esp_mail_imap_message_sub_type_rfc822;

          if (rfc822_body_subtype)
          {
            if (!_part->rfc822_part)
            {
              //additional rfc822 message header, store it to the rfc822 part header
              _part->rfc822_part = true;
              _part->rfc822_header = part.rfc822_header;
              imap->_rfc822_part_count++;
              _part->rfc822_msg_Idx = imap->_rfc822_part_count;
            }
          }
        }

        cHeader(imap)->part_headers.push_back(part);
        cHeader(imap)->message_data_count = cHeader(imap)->part_headers.size();

        if (part.msg_type == esp_mail_msg_type_plain || part.msg_type == esp_mail_msg_type_enriched || part.msg_type == esp_mail_msg_type_html || part.attach_type == esp_mail_att_type_none || (part.attach_type == esp_mail_att_type_attachment && imap->_config->download.attachment) || (part.attach_type == esp_mail_att_type_inline && imap->_config->download.inlineImg))
        {
          if (part.message_sub_type != esp_mail_imap_message_sub_type_rfc822)
          {
            if (part.attach_type != esp_mail_att_type_none && cHeader(imap)->multipart_sub_type != esp_mail_imap_multipart_sub_type_alternative)
              cHeader(imap)->attachment_count++;
          }
        }
      }
      else
      {
        //nonexistent part
        //return false to exit the loop without closing the connection
        if (closeSession)
          imap->closeSession();
        return false;
      }
    }

    if (imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_attachment || imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_text || imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_inline)
    {
      if (cPart(imap)->file_open_write)
        file.close();
    }

    if (imap->_imap_cmd == esp_mail_imap_cmd_fetch_body_text)
      cPart(imap)->text[cPart(imap)->textLen] = 0;
  }
  else
  {
    //some server responses NO and should exit (false) from MIME feching loop without
    //closing the session
    if (imap->_imap_cmd != esp_mail_imap_cmd_fetch_body_mime)
      return handleIMAPError(imap, errCode, false);

    if (closeSession)
      imap->closeSession();
    return false;
  }

  return true;
}

void ESP_Mail_Client::saveHeader(IMAPSession *imap)
{

  std::string headerFilePath;
  prepareFilePath(imap, headerFilePath, true);
  if (imap->_storageType == esp_mail_file_storage_type_sd && !_sdOk)
    _sdOk = sdTest();
  else if (imap->_storageType == esp_mail_file_storage_type_flash && !_flashOk)
#if defined(ESP32)
    _flashOk = ESP_MAIL_FLASH_FS.begin(FORMAT_FLASH);
#elif defined(ESP8266)
    _flashOk = ESP_MAIL_FLASH_FS.begin();
#endif

  if (_sdOk || _flashOk)
  {
    if (file)
      file.close();

    if (imap->_storageType == esp_mail_file_storage_type_sd)
      file = ESP_MAIL_SD_FS.open(headerFilePath.c_str(), FILE_WRITE);
    else if (imap->_storageType == esp_mail_file_storage_type_flash)
#if defined(ESP32)
      file = ESP_MAIL_FLASH_FS.open(headerFilePath.c_str(), FILE_WRITE);
#elif defined(ESP8266)
      file = ESP_MAIL_FLASH_FS.open(headerFilePath.c_str(), "w");
#endif

    if (file)
    {
      std::string s;
      appendP(s, esp_mail_str_99, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->date.c_str());

      appendP(s, esp_mail_str_100, true);
      file.print(s.c_str());
      if (imap->_uidSearch)
        file.println(cMSG(imap));
      else
        file.println();

      appendP(s, esp_mail_str_101, true);
      file.print(s.c_str());
      file.println(cMSG(imap));

      appendP(s, esp_mail_str_102, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->accept_language.c_str());

      appendP(s, esp_mail_str_103, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->content_language.c_str());

      appendP(s, esp_mail_str_10, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->from.c_str());

      appendP(s, esp_mail_str_105, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->from_charset.c_str());

      appendP(s, esp_mail_str_11, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->to.c_str());

      appendP(s, esp_mail_str_107, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->to_charset.c_str());

      appendP(s, esp_mail_str_108, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->cc.c_str());

      appendP(s, esp_mail_str_109, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->cc_charset.c_str());

      appendP(s, esp_mail_str_24, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->subject.c_str());

      appendP(s, esp_mail_str_111, true);
      file.print(s.c_str());
      file.println(cHeader(imap)->subject_charset.c_str());

      appendP(s, esp_mail_str_112, true);
      file.print(s.c_str());
      file.println(cPart(imap)->charset.c_str());

