bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.cpp
  filePath = fpath;
}

char *ESP_Mail_Client::strReplace(char *orig, char *rep, char *with)
{
  char *result = nullptr;
  char *ins = nullptr;
  char *tmp = nullptr;
  int len_rep;
  int len_with;
  int len_front;
  int count;

  len_with = strlen(with);
  len_rep = strlen(rep);

  ins = orig;
  for (count = 0; (tmp = strstr(ins, rep)); ++count)
    ins = tmp + len_rep;

  tmp = result = newS(strlen(orig) + (len_with - len_rep) * count + 1);
  while (count--)
  {
    ins = strstr(orig, rep);
    len_front = ins - orig;
    tmp = strncpy(tmp, orig, len_front) + len_front;
    tmp = strcpy(tmp, with) + len_with;
    orig += len_front + len_rep;
  }
  strcpy(tmp, orig);
  return result;
}

int ESP_Mail_Client::decodeChar(const char *s)
{
  return 16 * hexval(*(s + 1)) + hexval(*(s + 2));
}

void ESP_Mail_Client::decodeQP(const char *buf, char *out)
{
  char *tmp = strP(esp_mail_str_295);
  while (*buf)
  {
    if (*buf != '=')
      strcat_c(out, *buf++);
    else if (*(buf + 1) == '\r' && *(buf + 2) == '\n')
      buf += 3;
    else if (*(buf + 1) == '\n')
      buf += 2;
    else if (!strchr(tmp, *(buf + 1)))
      strcat_c(out, *buf++);
    else if (!strchr(tmp, *(buf + 2)))
      strcat_c(out, *buf++);
    else
    {
      strcat_c(out, decodeChar(buf));
      buf += 3;
    }
  }
  delS(tmp);
}

std::string ESP_Mail_Client::getBoundary(size_t len)
{
  char *tmp = strP(boundary_table);
  char *buf = newS(len);
  if (len)
  {
    --len;
    buf[0] = tmp[0];
    buf[1] = tmp[1];
    for (size_t n = 2; n < len; n++)
    {
      int key = rand() % (int)(strlen(tmp) - 1);
      buf[n] = tmp[key];
    }
    buf[len] = '\0';
  }
  std::string s = buf;
  delS(buf);
  delS(tmp);
  return s;
}

char *ESP_Mail_Client::decode7Bit(char *buf)
{
  char *out = strReplaceP(buf, imap_7bit_key1, imap_7bit_val1);
  char *tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key2, imap_7bit_val2);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key3, imap_7bit_val3);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key4, imap_7bit_val4);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key5, imap_7bit_val5);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key6, imap_7bit_val6);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key7, imap_7bit_val7);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key8, imap_7bit_val8);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key9, imap_7bit_val9);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key10, imap_7bit_val10);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key11, imap_7bit_val11);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key12, imap_7bit_val12);

  delS(tmp);
  tmp = newS(strlen(out) + 10);
  strcpy(tmp, out);
  delS(out);
  out = strReplaceP(tmp, imap_7bit_key13, imap_7bit_val13);
  delS(tmp);
  return out;
}

char *ESP_Mail_Client::strReplaceP(char *buf, PGM_P name, PGM_P value)
{
  char *n = strP(name);
  char *v = strP(value);
  char *out = strReplace(buf, n, v);
  delS(n);
  delS(v);
  return out;
}

void ESP_Mail_Client::handleCapability(IMAPSession *imap, char *buf, int &chunkIdx)
{
  if (chunkIdx == 0)
  {
    if (strposP(buf, esp_mail_imap_response_10, 0) > -1)
    {
      if (strposP(buf, esp_mail_imap_response_11, 0) > -1)
        imap->_auth_capability.login = true;
      if (strposP(buf, esp_mail_imap_response_12, 0) > -1)
        imap->_auth_capability.plain = true;
      if (strposP(buf, esp_mail_imap_response_13, 0) > -1)
        imap->_auth_capability.xoauth2 = true;
      if (strposP(buf, esp_mail_imap_response_14, 0) > -1)
        imap->_auth_capability.start_tls = true;
      if (strposP(buf, esp_mail_imap_response_15, 0) > -1)
        imap->_auth_capability.cram_md5 = true;
      if (strposP(buf, esp_mail_imap_response_16, 0) > -1)
        imap->_auth_capability.digest_md5 = true;
    }
  }
}

bool ESP_Mail_Client::authFailed(char *buf, int bufLen, int &chunkIdx, int ofs)
{
  bool ret = false;
  if (chunkIdx == 0)
  {
    size_t olen;
    unsigned char *decoded = decodeBase64((const unsigned char *)(buf + ofs), bufLen - ofs, &olen);
    if (decoded)
    {
      ret = strposP((char *)decoded, esp_mail_str_294, 0) > -1;
      delete[] decoded;
    }
    chunkIdx++;
  }
  return ret;
}

void ESP_Mail_Client::handleFolders(IMAPSession *imap, char *buf)
{
  struct esp_mail_folder_info_t fd;
  char *tmp = nullptr;
  int p1 = strposP(buf, esp_mail_imap_response_4, 0);
  int p2 = 0;
  if (p1 != -1)
  {
    p1 = strposP(buf, esp_mail_str_198, 0);
    if (p1 != -1)
    {
      p2 = strposP(buf, esp_mail_str_192, p1 + 1);
      if (p2 != -1)
      {
        tmp = newS(p2 - p1);
        strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
        if (tmp[p2 - p1 - 2] == '\r')
          tmp[p2 - p1 - 2] = 0;
        fd.attributes = tmp;
        delS(tmp);
      }
    }

    p1 = strposP(buf, esp_mail_str_136, 0);
    if (p1 != -1)
    {
      p2 = strposP(buf, esp_mail_str_136, p1 + 1);
      if (p2 != -1)
      {
        tmp = newS(p2 - p1);
        strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
        if (tmp[p2 - p1 - 2] == '\r')
          tmp[p2 - p1 - 2] = 0;
        fd.delimiter = tmp;
        delS(tmp);
      }
    }

    p1 = strposP(buf, esp_mail_str_131, p2);
    if (p1 != -1)
    {
      p2 = strlen(buf);
      tmp = newS(p2 - p1);
      if (buf[p1 + 1] == '"')
        p1++;
      strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
      if (tmp[p2 - p1 - 2] == '\r')
        tmp[p2 - p1 - 2] = 0;
      if (tmp[strlen(tmp) - 1] == '"')
        tmp[strlen(tmp) - 1] = 0;
      fd.name = tmp;
      delS(tmp);
    }
    imap->_folders.add(fd);
  }
}

